blog/31.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 4.1.1 and 4.1.2
#+subtitle: 2024-06-09 Sun
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)

* 4 Metalinguistic abstraction
We have seen several techniques that programmers can use to tame
complexity. So far we have used the Lisp language. But, as complexity
grows, it will not be sufficient. To the strategies for controlling
complexity we must add that of establishing new languages:
/metalinguistic abstraction/.

#+begin_quote
Establishing new languages is a powerful strategy for controlling
complexity in engineering design; we can often enhance our ability to
deal with a complex problem by adopting a new language that enables us
to describe (and hence to think about) the problem in a different way,
using primitives, means of combination, and means of abstraction that
are particularly well suited to the problem at hand.
#+end_quote

In computer programming, not only new languages can be formulated;
they can also be implemented by constructing /evaluators/ (aka
/interpreters/), that is, procedures that, when applied to an
expression of the relevant language (the language they are evaluators
of), perform the actions required to evaluate the expression.

#+begin_quote
It is no exaggeration to regard this as the most fundamental idea in
programming:

The evaluator, which determines the meaning of expressions in a
programming language, is just another program.

To appreciate this point is to change our images of ourselves as
programmers.  We come to see ourselves as designers of languages,
rather than only users of languages designed by others.

In fact, we can regard almost any program as the evaluator for some
language.
#+end_quote

From a certain perspective,
#+begin_quote
the technology for coping with large-scale computer systems merges
with the technology for building new computer languages, and computer
science itself becomes no more (and no less) than the discipline of
constructing appropriate descriptive languages.
#+end_quote

That's the technology this chapter explores. More precisely: the
technology by which languages are established in terms of other
languages. Needless to say, our evaluators will be written in
Lisp. The first evaluator will be for Lisp itself (a subset of the
Scheme dialect).

** 4.1 The Metacircular evaluator
#+begin_quote
An evaluator that is written in the same language that it evaluates is
said to be /metacircular/.

The metacircular evaluator is essentially a Scheme formulation of the
environment model of evaluation described in section 3.2. (362)
#+end_quote

#+begin_quote
The evaluation process can be described as the interplay between two
procedures: `eval' and `apply'.

Recall that the model has two basic parts...

[...]

The implementation of the evaluator will depend upon procedures that
define the "syntax" of the expressions to be evaluated.
#+end_quote

