blog/31.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-16 Sun 23:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 4.1.1 and 4.1.2</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 4.1.1 and 4.1.2
<br />
<span class="subtitle">2024-06-09 Sun</span>
</h1>

<div id="outline-container-orgff2e482" class="outline-2">
<h2 id="orgff2e482">4 Metalinguistic abstraction</h2>
<div class="outline-text-2" id="text-orgff2e482">
<p>
We have seen several techniques that programmers can use to tame
complexity. So far we have used the Lisp language. But, as complexity
grows, it will not be sufficient. To the strategies for controlling
complexity we must add that of establishing new languages:
<i>metalinguistic abstraction</i>.
</p>

<blockquote>
<p>
Establishing new languages is a powerful strategy for controlling
complexity in engineering design; we can often enhance our ability to
deal with a complex problem by adopting a new language that enables us
to describe (and hence to think about) the problem in a different way,
using primitives, means of combination, and means of abstraction that
are particularly well suited to the problem at hand. (359)
</p>
</blockquote>

<p>
In computer programming, not only new languages can be formulated;
they can also be implemented by constructing <i>evaluators</i> (aka
<i>interpreters</i>), that is, procedures that, when applied to an
expression of the relevant language (the language they are evaluators
of), perform the actions required to evaluate the expression.
</p>

<blockquote>
<p>
It is no exaggeration to regard this as the most fundamental idea in
programming:
</p>

<p>
The evaluator, which determines the meaning of expressions in a
programming language, is just another program.
</p>

<p>
To appreciate this point is to change our images of ourselves as
programmers.  We come to see ourselves as designers of languages,
rather than only users of languages designed by others.
</p>

<p>
In fact, we can regard almost any program as the evaluator for some
language. (360)
</p>
</blockquote>

<p>
From a certain perspective,
</p>
<blockquote>
<p>
the technology for coping with large-scale computer systems merges
with the technology for building new computer languages, and computer
science itself becomes no more (and no less) than the discipline of
constructing appropriate descriptive languages. (361)
</p>
</blockquote>

<p>
That's the technology this chapter explores. More precisely: the
technology by which languages are established in terms of other
languages. Needless to say, our evaluators will be written in
Lisp. The first evaluator will be for Lisp itself (a subset of the
Scheme dialect).
</p>
</div>

<div id="outline-container-orgf5ff1ab" class="outline-3">
<h3 id="orgf5ff1ab">4.1 The Metacircular evaluator</h3>
<div class="outline-text-3" id="text-orgf5ff1ab">
<blockquote>
<p>
An evaluator that is written in the same language that it evaluates is
said to be <i>metacircular</i>.
</p>

<p>
The metacircular evaluator is essentially a Scheme formulation of the
environment model of evaluation described in section 3.2. (362)
</p>
</blockquote>

<blockquote>
<p>
The evaluation process can be described as the interplay between two
procedures: `eval' and `apply'.
</p>

<p>
Recall that the model has two basic parts&#x2026;
</p>

<p>
[&#x2026;]
</p>

<p>
The implementation of the evaluator will depend upon procedures that
define the "syntax" of the expressions to be evaluated. (363)
</p>
</blockquote>
</div>
