blog/31.org
*** 4.1.1 The Core of the Evaluator
``Abstract syntax'':
#+begin_quote
Each type of expression has a predicate that tests for it and an
abstract means for selecting its parts.
#+end_quote

- Primitive expressions
- Special forms
  - quoted expressions
  - assignments/definitions of a variable
  - ~if~ expressions
  - ~lambda~ expressions
  - ~begin~
  - ~cond~
- Combinations

#+begin_src
*Figure 4.1:* The `eval'-`apply' cycle exposes the essence of a
computer language.

                                     .,ad88888888baa,
                            _    ,d8P"""        ""9888ba.      _
                           /  .a8"          ,ad88888888888a   |\
                         /   aP'          ,88888888888888888a   \
                        /  ,8"           ,88888888888888888888,  \
                       |  ,8'            (888888888888888888888, |
                      /  ,8'             `8888888888888888888888  \
                      |  8)               `888888888888888888888, |
          Procedure,  |  8                  "88888 Apply 8888888) | Expression
          Arguments   |  8     Eval          `888888888888888888) | Environment
                      |  8)                    "8888888888888888  |
                      \  (b                     "88888888888888'  /
                       | `8,                     8888888888888)  |
                       \  "8a                   ,888888888888)  /
                        \   V8,                 d88888888888"  /
                        _\| `8b,             ,d8888888888P' _/
                               `V8a,       ,ad8888888888P'
                                  ""88888888888888888P"
                                       """"""""""""

[graphic by Normand Veillux, modified]
[Figure from SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007)]
#+end_src

Here is ~eval~:
#+begin_src scheme
  (define (eval exp env)
    (cond ((self-evaluating? exp) exp)
          ((variable? exp) (lookup-variable-value exp env))
          ((quoted? exp) (text-of-quotation exp))
          ((assignment? exp) (eval-assignment exp env))
          ((definition? exp) (eval-definition exp env))
          ((if? exp) (eval-if exp env))
          ((lambda? exp)
           (make-procedure (lambda-parameters exp)
                           (lambda-body exp)
                           env))
          ((begin? exp)
           (eval-sequence (begin-actions exp) env))
          ((cond? exp) (eval (cond->if exp) env))
          ((application? exp)
           (apply (eval (operator exp) env)
                  (list-of-values (operands exp) env)))
          (else
           (error "Unknown expression type -- EVAL" exp))))
#+end_src

Here is ~apply~:
#+begin_src scheme
  (define (apply procedure arguments)
    (cond ((primitive-procedure? procedure)
           (apply-primitive-procedure procedure arguments))
          ((compound-procedure? procedure)
           (eval-sequence
            (procedure-body procedure)
            (extend-environment
             (procedure-parameters procedure)
             arguments
             (procedure-environment procedure))))
          (else
           (error
            "Unknown procedure type -- APPLY" procedure))))
#+end_src

The rest:
#+begin_src scheme
  (define (list-of-values exps env)
    (if (no-operands? exps)
        '()
        (cons (eval (first-operand exps) env)
              (list-of-values (rest-operands exps) env))))

  (define (eval-if exp env)
    (if (true? (eval (if-predicate exp) env))
        (eval (if-consequent exp) env)
        (eval (if-alternative exp) env)))

  (define (eval-sequence exps env)
    (cond ((last-exp? exps) (eval (first-exp exps) env))
          (else (eval (first-exp exps) env)
                (eval-sequence (rest-exps exps) env))))

  (define (eval-assignment exp env)
    (set-variable-value! (assignment-variable exp)
                         (eval (assignment-value exp) env)
                         env)
    'ok)

  (define (eval-definition exp env)
    (define-variable! (definition-variable exp)
      (eval (definition-value exp) env)
      env)
    'ok)
#+end_src

*** Exercise 4.1
*Exercise*:
#+begin_quote
Notice that we cannot tell whether the metacircular evaluator
evaluates operands from left to right or from right to left.  Its
evaluation order is inherited from the underlying Lisp: If the
arguments to ~cons~ in ~list-of-values~ are evaluated from left to
right, then ~list-of-values~ will evaluate operands from left to
right; and if the arguments to ~cons~ are evaluated from right to
left, then ~list-of-values~ will evaluate operands from right to left.

Write a version of ~list-of-values~ that evaluates operands from left
to right regardless of the order of evaluation in the underlying Lisp.
Also write a version of ~list-of-values~ that evaluates operands from
right to left.
#+end_quote

*Answer*:

Looking at the solutions published online, this is the widespread
approach:
#+begin_src scheme
  ;; left to right
  (define (list-of-values exps env)
    (if (no-operands? exps)
        '()
        (let ((fst (eval (first-operand exps) env)))
          (cons fst
                (list-of-values (rest-operands exps) env)))))
  ;; see, for example: https://youtu.be/eoNyHC_cM7w?list=PLVFrD1dmDdvdvWFK8brOVNL7bKHpE-9w0
#+end_src

Analogously, but without using ~let~ (which is just syntactic sugar):
#+begin_src scheme
  (define (list-of-values-left exp env)
    (if (no-operands? exp)
        '()
        ((lambda (first-value)
           (cons first-value (list-of-values-left (rest-operands-exps) env)))
         (eval (first-operand exps) env))))
  ;; found here: https://github.com/cmccloud/SICP/blob/master/exercise-4.1.scm
#+end_src

My solution was a bit more... complex. But it should count as valid,
shouldn't it?
#+begin_src scheme
  (define (list-of-values exps env)
    ;; return exps as they are except for the nth exp which is evaluated
    ;; as an operand
    (define (eval-nth-operand exps env n)
      (cond ((no-operands? exps)
             '())
            ((= n 0)
             (cons (eval (first-operand exps) env)
                   (cdr exps)))
            (else (cons (car exps)
                        (eval-nth-operand (cdr exps) env (- n 1))))))

    ;; iteratively call eval-nth-operand for each exp
    (define (iter exps env count)
      (if (= count (length exps))
          exps
          (iter (eval-nth-operand exps env count)
                env
                (+ count 1))))

    (iter exps env 0))
#+end_src

