blog/31.html

<div id="outline-container-orgfb31030" class="outline-4">
<h4 id="orgfb31030">4.1.1 The Core of the Evaluator</h4>
<div class="outline-text-4" id="text-orgfb31030">
<p>
``Abstract syntax'':
</p>
<blockquote>
<p>
Each type of expression has a predicate that tests for it and an
abstract means for selecting its parts. (364)
</p>
</blockquote>

<ul class="org-ul">
<li>Primitive expressions</li>
<li>Special forms
<ul class="org-ul">
<li>quoted expressions</li>
<li>assignments/definitions of a variable</li>
<li><code>if</code> expressions</li>
<li><code>lambda</code> expressions</li>
<li><code>begin</code></li>
<li><code>cond</code></li>
</ul></li>
<li>Combinations</li>
</ul>

<pre class="example">
*Figure 4.1:* The `eval'-`apply' cycle exposes the essence of a
computer language.

                                     .,ad88888888baa,
                            _    ,d8P"""        ""9888ba.      _
                           /  .a8"          ,ad88888888888a   |\
                         /   aP'          ,88888888888888888a   \
                        /  ,8"           ,88888888888888888888,  \
                       |  ,8'            (888888888888888888888, |
                      /  ,8'             `8888888888888888888888  \
                      |  8)               `888888888888888888888, |
          Procedure,  |  8                  "88888 Apply 8888888) | Expression
          Arguments   |  8     Eval          `888888888888888888) | Environment
                      |  8)                    "8888888888888888  |
                      \  (b                     "88888888888888'  /
                       | `8,                     8888888888888)  |
                       \  "8a                   ,888888888888)  /
                        \   V8,                 d88888888888"  /
                        _\| `8b,             ,d8888888888P' _/
                               `V8a,       ,ad8888888888P'
                                  ""88888888888888888P"
                                       """"""""""""

[graphic by Normand Veillux, modified]
[Figure from SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007)]
</pre>

<p>
Here is <code>eval</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval</span> exp env)
  (<span style="color: #531ab6;">cond</span> ((self-evaluating? exp) exp)
        ((variable? exp) (lookup-variable-value exp env))
        ((quoted? exp) (text-of-quotation exp))
        ((assignment? exp) (eval-assignment exp env))
        ((definition? exp) (eval-definition exp env))
        ((if? exp) (eval-if exp env))
        ((lambda? exp)
         (make-procedure (lambda-parameters exp)
                         (lambda-body exp)
                         env))
        ((begin? exp)
         (eval-sequence (begin-actions exp) env))
        ((cond? exp) (eval (cond-&gt;if exp) env))
        ((application? exp)
         (apply (eval (operator exp) env)
                (list-of-values (operands exp) env)))
        (<span style="color: #531ab6;">else</span>
         (error <span style="color: #3548cf;">"Unknown expression type -- EVAL"</span> exp))))
</pre>
</div>

<p>
Here is <code>apply</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">apply</span> procedure arguments)
  (<span style="color: #531ab6;">cond</span> ((primitive-procedure? procedure)
         (apply-primitive-procedure procedure arguments))
        ((compound-procedure? procedure)
         (eval-sequence
          (procedure-body procedure)
          (extend-environment
           (procedure-parameters procedure)
           arguments
           (procedure-environment procedure))))
        (<span style="color: #531ab6;">else</span>
         (error
          <span style="color: #3548cf;">"Unknown procedure type -- APPLY"</span> procedure))))
</pre>
</div>

<p>
The rest:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-of-values</span> exps env)
  (<span style="color: #531ab6;">if</span> (no-operands? exps)
      '()
      (cons (eval (first-operand exps) env)
            (list-of-values (rest-operands exps) env))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-if</span> exp env)
  (<span style="color: #531ab6;">if</span> (true? (eval (if-predicate exp) env))
      (eval (if-consequent exp) env)
      (eval (if-alternative exp) env)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-sequence</span> exps env)
  (<span style="color: #531ab6;">cond</span> ((last-exp? exps) (eval (first-exp exps) env))
        (<span style="color: #531ab6;">else</span> (eval (first-exp exps) env)
              (eval-sequence (rest-exps exps) env))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-assignment</span> exp env)
  (set-variable-value! (assignment-variable exp)
                       (eval (assignment-value exp) env)
                       env)
  'ok)

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-definition</span> exp env)
  (define-variable! (definition-variable exp)
    (eval (definition-value exp) env)
    env)
  'ok)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3c75410" class="outline-4">
<h4 id="org3c75410">Exercise 4.1</h4>
<div class="outline-text-4" id="text-org3c75410">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Notice that we cannot tell whether the metacircular evaluator
evaluates operands from left to right or from right to left.  Its
evaluation order is inherited from the underlying Lisp: If the
arguments to <code>cons</code> in <code>list-of-values</code> are evaluated from left to
right, then <code>list-of-values</code> will evaluate operands from left to
right; and if the arguments to <code>cons</code> are evaluated from right to
left, then <code>list-of-values</code> will evaluate operands from right to left.
</p>

<p>
Write a version of <code>list-of-values</code> that evaluates operands from left
to right regardless of the order of evaluation in the underlying Lisp.
Also write a version of <code>list-of-values</code> that evaluates operands from
right to left.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Looking at the solutions published online, this is the widespread
approach:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">left to right</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-of-values</span> exps env)
  (<span style="color: #531ab6;">if</span> (no-operands? exps)
      '()
      (<span style="color: #531ab6;">let</span> ((fst (eval (first-operand exps) env)))
        (cons fst
              (list-of-values (rest-operands exps) env)))))
<span style="color: #595959;">;; </span><span style="color: #595959;">see, for example: https://youtu.be/eoNyHC_cM7w?list=PLVFrD1dmDdvdvWFK8brOVNL7bKHpE-9w0</span>
</pre>
</div>

<p>
Analogously, but without using <code>let</code> (which is just syntactic sugar):
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-of-values-left</span> exp env)
  (<span style="color: #531ab6;">if</span> (no-operands? exp)
      '()
      ((<span style="color: #531ab6;">lambda</span> (first-value)
         (cons first-value (list-of-values-left (rest-operands-exps) env)))
       (eval (first-operand exps) env))))
<span style="color: #595959;">;; </span><span style="color: #595959;">found here: https://github.com/cmccloud/SICP/blob/master/exercise-4.1.scm</span>
</pre>
</div>

<p>
My solution was a bit more&#x2026; complex. But it should count as valid,
shouldn't it?
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-of-values</span> exps env)
  <span style="color: #595959;">;; </span><span style="color: #595959;">return exps as they are except for the nth exp which is evaluated</span>
  <span style="color: #595959;">;; </span><span style="color: #595959;">as an operand</span>
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-nth-operand</span> exps env n)
    (<span style="color: #531ab6;">cond</span> ((no-operands? exps)
           '())
          ((= n 0)
           (cons (eval (first-operand exps) env)
                 (cdr exps)))
          (<span style="color: #531ab6;">else</span> (cons (car exps)
                      (eval-nth-operand (cdr exps) env (- n 1))))))

  <span style="color: #595959;">;; </span><span style="color: #595959;">iteratively call eval-nth-operand for each exp</span>
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">iter</span> exps env count)
    (<span style="color: #531ab6;">if</span> (= count (length exps))
        exps
        (iter (eval-nth-operand exps env count)
              env
              (+ count 1))))

  (iter exps env 0))
</pre>
</div>
</div>
</div>
