blog/31.html

<div id="outline-container-orgf94614e" class="outline-4">
<h4 id="orgf94614e">4.1.2 Representing Expressions</h4>
<div class="outline-text-4" id="text-orgf94614e">
<p>
Authors presents the ``specification of the syntax'' of the language:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">self-evaluating?</span> exp)
  (<span style="color: #531ab6;">cond</span> ((number? exp) true)
        ((string? exp) true)
        (<span style="color: #531ab6;">else</span> false)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">variable?</span> exp) (symbol? exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">quoted?</span> exp)
  (tagged-list? exp 'quote))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">text-of-quotation</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tagged-list?</span> exp tag)
  (<span style="color: #531ab6;">if</span> (pair? exp)
      (eq? (car exp) tag)
      false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment?</span> exp)
  (tagged-list? exp 'set!))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment-variable</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment-value</span> exp) (caddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">definition?</span> exp)
  (tagged-list? exp 'define))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">definition-variable</span> exp)
  (<span style="color: #531ab6;">if</span> (symbol? (cadr exp))
      (cadr exp)
      (caadr exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">definition-value</span> exp)
  (<span style="color: #531ab6;">if</span> (symbol? (cadr exp))
      (caddr exp)
      (make-lambda (cdadr exp)   <span style="color: #595959;">; </span><span style="color: #595959;">formal parameters</span>
                   (cddr exp)))) <span style="color: #595959;">; </span><span style="color: #595959;">body</span>

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda?</span> exp) (tagged-list? exp 'lambda))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda-parameters</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda-body</span> exp) (cddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda?</span> exp) (tagged-list? exp 'lambda))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda-parameters</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lambda-body</span> exp) (cddr exp))

<span style="color: #595959;">;; </span><span style="color: #595959;">Authors provide a constructor as well:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-lambda</span> parameters body)
  (cons 'lambda (cons parameters body)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if?</span> exp) (tagged-list? exp 'if))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if-predicate</span> exp) (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if-consequent</span> exp) (caddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">if-alternative</span> exp)
  (<span style="color: #531ab6;">if</span> (not (null? (cdddr exp)))
      (cadddr exp)
      'false))

<span style="color: #595959;">;; </span><span style="color: #595959;">Authors provide a constructor as well:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-if</span> predicate consequent alternative)
  (list 'if predicate consequent alternative))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">begin?</span> exp) (tagged-list? exp 'begin))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">begin-actions</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">last-exp?</span> seq) (null? (cdr seq)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-exp</span> seq) (car seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rest-exps</span> seq) (cdr seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">sequence-&gt;exp</span> seq)
  (<span style="color: #531ab6;">cond</span> ((null? seq) seq)
        ((last-exp? seq) (first-exp seq))
        (<span style="color: #531ab6;">else</span> (make-begin seq))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-begin</span> seq) (cons 'begin seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">application?</span> exp) (pair? exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operator</span> exp) (car exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operands</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">no-operands?</span> ops) (null? ops))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-operand</span> ops) (car ops))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rest-operands</span> ops) (cdr ops))
</pre>
</div>

<p>
Certain expression are ``derived''. <code>Cond</code> is one of them, since it
can be transformed into an <code>if</code> expression.
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond?</span> exp) (tagged-list? exp 'cond))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-clauses</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-else-clause?</span> clause)
  (eq? (cond-predicate clause) 'else))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-predicate</span> clause) (car clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-actions</span> clause) (cdr clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-&gt;if</span> exp)
  (expand-clauses (cond-clauses exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">expand-clauses</span> clauses)
  (<span style="color: #531ab6;">if</span> (null? clauses)
      'false                          <span style="color: #595959;">; </span><span style="color: #595959;">no `else' clause</span>
      (<span style="color: #531ab6;">let</span> ((first (car clauses))
            (rest (cdr clauses)))
        (<span style="color: #531ab6;">if</span> (cond-else-clause? first)
            (<span style="color: #531ab6;">if</span> (null? rest)
                (sequence-&gt;exp (cond-actions first))
                (error <span style="color: #3548cf;">"ELSE clause isn't last -- COND-&gt;IF"</span>
                       clauses))
            (make-if (cond-predicate first)
                     (sequence-&gt;exp (cond-actions first))
                     (expand-clauses rest))))))
</pre>
</div>
</div>
</div>
