blog/31.org
*** Exercise 4.2:
*Exercise*:

#+begin_quote
Louis Reasoner plans to reorder the ~cond~ clauses in ~eval~ so that
the clause for procedure applications appears before the clause for
assignments.  He argues that this will make the interpreter more
efficient: Since programs usually contain more applications than
assignments, definitions, and so on, his modified ~eval~ will usually
check fewer clauses than the original ~eval~ before identifying the
type of an expression.

a. What is wrong with Louis's plan?  (Hint: What will Louis's
evaluator do with the expression ~(define x 3)~?)

b. Louis is upset that his plan didn't work.  He is willing to go to
any lengths to make his evaluator recognize procedure applications
before it checks for most other kinds of expressions.  Help him by
changing the syntax of the evaluated language so that procedure
applications start with ~call~.  For example, instead of ~(factorial
3)~ we will now have to write ~(call factorial 3)~ and instead of ~(+
1 2)~ we will have to write ~(call + 1 2)~.
#+end_quote

*Answer*:

- *a)* If we do as Louis say, then, the evaluator will think that
  ~(define x 3)~ is an application, because ~(application? exp)~ will
  return true. Given so, the evaluator will evaluate the expression
  #+begin_src scheme
    (apply (eval (operator exp) env) (list-of-values (operands exp) env))
  #+end_src

  ~(operator exp)~ evaluates to ~x~, and ~(operands exp)~ evaluates to
  the list ~(3)~.

  So we have
  #+begin_src scheme
    (apply (eval x env) (list-of-values (3) env))
  #+end_src
   
  The problem is that ~x~ in ~(eval x env)~ will be taken as a
  variable and, therefore, we will try to evaluate
  ~(lookup-variable-value x env)~.
  
  We haven't looked at ~lookup-variable-value~ yet, but, regardless,
  given that ~x~ hasn't been defined, we shouldn't be looking it up.

- *b)* This should be enough as far as I can see:
  #+begin_src scheme
    (define (application? exp)
      (tagged-list exp 'call))

    (define (operator exp)
      (cadr exp))

    (define (operands exp)
      (cddr exp))
  #+end_src

*** Exercise 4.3
*Exercise*:
#+begin_quote
Rewrite ~eval~ so that the dispatch is done in data-directed style.
Compare this with the data-directed differentiation procedure of
Exercise 2-73.  (You may use the ~car~ of a compound expression as the
type of the expression, as is appropriate for the syntax implemented
in this section.)
#+end_quote

*Answer*:

I think the code would look like something like this:

#+begin_src scheme
  (define (type-tag datum) ;; p. 176
    (if (pair? datum)
        (car datum)
        (error "Bad tagged datum -- TYPE-TAG" datum)))

  (define (contents datum) ;; p. 176
    (if (pair? datum)
        (cdr datum)
        (error "Bad tagged datum -- CONTENTS" datum)))

  (define (eval exp env)
    (let ((tag (type-tag exp)))
      (let ((proc (get 'eval tag))
            (if proc
                (apply proc (list contents env))
                (error "no proc found"))))))

  (put 'eval
       'self-evaluating
       (lambda (exp env) exp))

  (put 'eval
       'variable
       lookup-variable-value))
  ;; etc.
#+end_src

*** Exercise 4.4
*Exercise*:
#+begin_quote
Recall the definitions of the special forms ~and~ and ~or~ from
Chapter 1:

 ~and~: The expressions are evaluated from left to right.  If any
expression evaluates to false, false is returned; any remaining
expressions are not evaluated.  If all the expressions evaluate to
true values, the value of the last expression is returned.  If there
are no expressions then true is returned.

 ~or~: The expressions are evaluated from left to right.  If any
expression evaluates to a true value, that value is returned; any
remaining expressions are not evaluated.  If all expressions evaluate
to false, or if there are no expressions, then false is returned.

Install ~and~ and ~or~ as new special forms for the evaluator by
defining appropriate syntax procedures and evaluation procedures
~eval-and~ and ~eval-or~.  Alternatively, show how to implement ~and~
and ~or~ as derived expressions.
#+end_quote

*Answer*:
#+begin_src scheme
  ;; syntax procedures
  (define (and? exp)
    (tagged-list exp 'and))

  (define (or? exp)
    (tagged-list exp 'and))

  ;; evaluation procedures
  (define (eval-and exp env)
    (if (null? (conjuncts exp))
        true
        (let ((1st-evaluated-conjunct
               (eval (1st-conjunct exp) env)))
          (if (false? 1st-evaluated-conjunct)
              false
              (let ((rest (rest-conjuncts exp)))
                (if (null? rest)
                    1st-evaluated-conjunct
                    (eval-and (cons 'and rest) env)))))))

  (define (eval-or exp env)
    (if (null? (disjuncts exp))
        false
        (let ((1st-evaluated-disjunct
               (eval (1st-disjunct exp) env)))
          (if (true? 1st-evaluated-disjunct)
              1st-evaluated-disjunct
              (eval-or (cons 'or (rest-disjuncts exp)) env)))))
#+end_src

