blog/31.html

<div id="outline-container-org22f6324" class="outline-4">
<h4 id="org22f6324">Exercise 4.2:</h4>
<div class="outline-text-4" id="text-org22f6324">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Louis Reasoner plans to reorder the <code>cond</code> clauses in <code>eval</code> so that
the clause for procedure applications appears before the clause for
assignments.  He argues that this will make the interpreter more
efficient: Since programs usually contain more applications than
assignments, definitions, and so on, his modified <code>eval</code> will usually
check fewer clauses than the original <code>eval</code> before identifying the
type of an expression.
</p>

<p>
a. What is wrong with Louis's plan?  (Hint: What will Louis's
evaluator do with the expression <code>(define x 3)</code>?)
</p>

<p>
b. Louis is upset that his plan didn't work.  He is willing to go to
any lengths to make his evaluator recognize procedure applications
before it checks for most other kinds of expressions.  Help him by
changing the syntax of the evaluated language so that procedure
applications start with <code>call</code>.  For example, instead of <code>(factorial
3)</code> we will now have to write <code>(call factorial 3)</code> and instead of <code>(+
1 2)</code> we will have to write <code>(call + 1 2)</code>.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<ul class="org-ul">
<li><p>
<b>a)</b> If we do as Louis say, then, the evaluator will think that
<code>(define x 3)</code> is an application, because <code>(application? exp)</code> will
return true. Given so, the evaluator will evaluate the expression
</p>
<div class="org-src-container">
<pre class="src src-scheme">(apply (eval (operator exp) env) (list-of-values (operands exp) env))
</pre>
</div>

<p>
<code>(operator exp)</code> evaluates to <code>x</code>, and <code>(operands exp)</code> evaluates to
the list <code>(3)</code>.
</p>

<p>
So we have
</p>
<div class="org-src-container">
<pre class="src src-scheme">(apply (eval x env) (list-of-values (3) env))
</pre>
</div>

<p>
The problem is that <code>x</code> in <code>(eval x env)</code> will be taken as a
variable and, therefore, we will try to evaluate
<code>(lookup-variable-value x env)</code>.
</p>

<p>
We haven't looked at <code>lookup-variable-value</code> yet, but, regardless,
given that <code>x</code> hasn't been defined, we shouldn't be looking it up.
</p></li>

<li><p>
<b>b)</b> This should be enough as far as I can see:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">application?</span> exp)
  (tagged-list exp 'call))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operator</span> exp)
  (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">operands</span> exp)
  (cddr exp))
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org83d4296" class="outline-4">
<h4 id="org83d4296">Exercise 4.3</h4>
<div class="outline-text-4" id="text-org83d4296">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Rewrite <code>eval</code> so that the dispatch is done in data-directed style.
Compare this with the data-directed differentiation procedure of
Exercise 2-73.  (You may use the <code>car</code> of a compound expression as the
type of the expression, as is appropriate for the syntax implemented
in this section.)
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
I think the code would look like something like this:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">type-tag</span> datum) <span style="color: #595959;">;; </span><span style="color: #595959;">p. 176</span>
  (<span style="color: #531ab6;">if</span> (pair? datum)
      (car datum)
      (error <span style="color: #3548cf;">"Bad tagged datum -- TYPE-TAG"</span> datum)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">contents</span> datum) <span style="color: #595959;">;; </span><span style="color: #595959;">p. 176</span>
  (<span style="color: #531ab6;">if</span> (pair? datum)
      (cdr datum)
      (error <span style="color: #3548cf;">"Bad tagged datum -- CONTENTS"</span> datum)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval</span> exp env)
  (<span style="color: #531ab6;">let</span> ((tag (type-tag exp)))
    (<span style="color: #531ab6;">let</span> ((proc (get 'eval tag))
          (<span style="color: #531ab6;">if</span> proc
              (apply proc (list contents env))
              (error <span style="color: #3548cf;">"no proc found"</span>))))))

(put 'eval
     'self-evaluating
     (<span style="color: #531ab6;">lambda</span> (exp env) exp))

(put 'eval
     'variable
     lookup-variable-value))
<span style="color: #595959;">;; </span><span style="color: #595959;">etc.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaee23d0" class="outline-4">
<h4 id="orgaee23d0">Exercise 4.4</h4>
<div class="outline-text-4" id="text-orgaee23d0">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Recall the definitions of the special forms <code>and</code> and <code>or</code> from
Chapter 1:
</p>

<p>
 <code>and</code>: The expressions are evaluated from left to right.  If any
expression evaluates to false, false is returned; any remaining
expressions are not evaluated.  If all the expressions evaluate to
true values, the value of the last expression is returned.  If there
are no expressions then true is returned.
</p>

<p>
 <code>or</code>: The expressions are evaluated from left to right.  If any
expression evaluates to a true value, that value is returned; any
remaining expressions are not evaluated.  If all expressions evaluate
to false, or if there are no expressions, then false is returned.
</p>

<p>
Install <code>and</code> and <code>or</code> as new special forms for the evaluator by
defining appropriate syntax procedures and evaluation procedures
<code>eval-and</code> and <code>eval-or</code>.  Alternatively, show how to implement <code>and</code>
and <code>or</code> as derived expressions.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">syntax procedures</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">and?</span> exp)
  (tagged-list exp 'and))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">or?</span> exp)
  (tagged-list exp 'and))

<span style="color: #595959;">;; </span><span style="color: #595959;">evaluation procedures</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-and</span> exp env)
  (<span style="color: #531ab6;">if</span> (null? (conjuncts exp))
      true
      (<span style="color: #531ab6;">let</span> ((1st-evaluated-conjunct
             (eval (1st-conjunct exp) env)))
        (<span style="color: #531ab6;">if</span> (false? 1st-evaluated-conjunct)
            false
            (<span style="color: #531ab6;">let</span> ((rest (rest-conjuncts exp)))
              (<span style="color: #531ab6;">if</span> (null? rest)
                  1st-evaluated-conjunct
                  (eval-and (cons 'and rest) env)))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-or</span> exp env)
  (<span style="color: #531ab6;">if</span> (null? (disjuncts exp))
      false
      (<span style="color: #531ab6;">let</span> ((1st-evaluated-disjunct
             (eval (1st-disjunct exp) env)))
        (<span style="color: #531ab6;">if</span> (true? 1st-evaluated-disjunct)
            1st-evaluated-disjunct
            (eval-or (cons 'or (rest-disjuncts exp)) env)))))
</pre>
</div>
</div>
</div>
