blog/31.org
*** Exercise 4.5
*Exercise*:
#+begin_quote
Scheme allows an additional syntax for ~cond~ clauses, ~(<TEST> =>
<RECIPIENT>)~.  If <TEST> evaluates to a true value, then <RECIPIENT>
is evaluated.  Its value must be a procedure of one argument; this
procedure is then invoked on the value of the <TEST>, and the result
is returned as the value of the `cond' expression.  For example

#+begin_src scheme
  (cond ((assoc 'b '((a 1) (b 2))) => cadr)
  (else false))
#+end_src

returns 2.  Modify the handling of ~cond~ so that it supports this
extended syntax.
#+end_quote

*Answer*:

#+begin_src scheme
  #lang sicp
  (define (tagged-list? exp tag)
    (if (pair? exp)
        (eq? (car exp) tag)
        false))

  (define (begin? exp) (tagged-list? exp 'begin))

  (define (begin-actions exp) (cdr exp))

  (define (last-exp? seq) (null? (cdr seq)))

  (define (first-exp seq) (car seq))

  (define (rest-exps seq) (cdr seq))

  (define (sequence->exp seq)
    (cond ((null? seq) seq)
          ((last-exp? seq) (first-exp seq))
          (else (make-begin seq))))

  (define (sequence->exp2 seq)
    (cond ((null? seq) seq)
          ((last-exp? seq) (first-exp seq))
          (else (make-begin seq))))

  (define (make-begin seq) (cons 'begin seq))

  (define (cond? exp) (tagged-list? exp 'cond))

  (define (cond-clauses exp) (cdr exp))

  (define (cond-else-clause? clause)
    (eq? (cond-predicate clause) 'else))

  (define (cond-predicate clause) (car clause))

  (define (cond-actions clause) (cdr clause))

  (define (alternative-cond-actions clause)
    (list (caddr clause) (car clause)))

  (define (cond->if exp)
    (expand-clauses (cond-clauses exp)))

  (define (make-if predicate consequent alternative)
    (list 'if predicate consequent alternative))

  (define (alternative-cond? exp)
    (eq? (cadr exp) '=>))

  (define (expand-clauses clauses)
    (if (null? clauses)
        'false                          ; no `else' clause
        (let ((first (car clauses))
              (rest (cdr clauses)))
          (if (cond-else-clause? first)
              (if (null? rest)
                  (if (alternative-cond? first)
                      (alternative-cond-actions first)
                      (sequence->exp (cond-actions first)))
                  (error "ELSE clause isn't last -- COND->IF"
                         clauses))
              (make-if (cond-predicate first)
                       (if (alternative-cond? first)
                           (alternative-cond-actions first)
                           (sequence->exp (cond-actions first)))
                       (expand-clauses rest))))))

  (cond->if
   '(cond ((assoc 'b '((a 1) (b 2))) => cadr)
          (else false)))
  ;; =>
  ;;(if (assoc 'b '((a 1) (b 2)))
  ;;    (cadr (assoc 'b '((a 1) (b 2))))
  ;;    false)
#+end_src

*** Exercise 4.6
*Exercise*:
#+begin_quote
`Let' expressions are derived expressions, because

#+begin_src scheme
  (let ((<VAR_1> <EXP_1>) ... (<VAR_N> <EXP_N>))
    <BODY>)
#+end_src

is equivalent to

#+begin_src scheme
  ((lambda (<VAR_1> ... <VAR_N>)
     <BODY>)
   <EXP_1>
   ...
   <EXP_N>)
#+end_src

Implement a syntactic transformation ~let->combination~ that reduces
evaluating ~let~ expressions to evaluating combinations of the type
shown above, and add the appropriate clause to ~eval~ to handle ~let~
expressions.
#+end_quote

*Answer*:

#+begin_src scheme
  #lang sicp
  (define (tagged-list? exp tag)
    (if (pair? exp)
        (eq? (car exp) tag)
        false))

  (define (let? exp) (tagged-list? exp 'let))

  (define (let-vars exp)
    (map car (cadr exp)))

  (define (let-exps exp)
    (map cadr (cadr exp)))

  (define (let-body exp)
    (cddr exp))

  (define (let-combination exp)
    (cons (list 'lambda
                (let-vars exp)
                (let-body exp))
          (let-exps exp)))

  ;; Example:
  (let ((let-exp '(let ((foo (* 2 4))
                        (bar (* 4 6)))
                    (display foo)
                    (display bar))))
    (let-combination let-exp))
  ;; =>
  ;;((lambda (foo bar)
  ;;   ((display foo)
  ;;    (display bar)))
  ;; (* 2 4) (* 4 6))

  ;; Modifying eval:
  (define (eval exp env)
    (cond ((self-evaluating? exp) exp)
          ((variable? exp) (lookup-variable-value exp env))
          ((quoted? exp) (text-of-quotation exp))
          ((assignment? exp) (eval-assignment exp env))
          ((definition? exp) (eval-definition exp env))
          ((if? exp) (eval-if exp env))
          ((lambda? exp)
           (make-procedure (lambda-parameters exp)
                           (lambda-body exp)
                           env))
          ((begin? exp)
           (eval-sequence (begin-actions exp) env))
          ((cond? exp) (eval (cond->if exp) env))
          ((let? exp) (eval (let-combination) env)) ;; <----------------
          ((application? exp)
           (apply (eval (operator exp) env)
                  (list-of-values (operands exp) env)))
          (else
           (error "Unknown expression type -- EVAL" exp))))
#+end_src

