blog/31.html

<div id="outline-container-org1b8c51c" class="outline-4">
<h4 id="org1b8c51c">Exercise 4.5</h4>
<div class="outline-text-4" id="text-org1b8c51c">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Scheme allows an additional syntax for <code>cond</code> clauses, <code>(&lt;TEST&gt; =&gt;
&lt;RECIPIENT&gt;)</code>.  If &lt;TEST&gt; evaluates to a true value, then &lt;RECIPIENT&gt;
is evaluated.  Its value must be a procedure of one argument; this
procedure is then invoked on the value of the &lt;TEST&gt;, and the result
is returned as the value of the `cond' expression.  For example
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">cond</span> ((assoc 'b '((a 1) (b 2))) =&gt; cadr)
(<span style="color: #531ab6;">else</span> false))
</pre>
</div>

<p>
returns 2.  Modify the handling of <code>cond</code> so that it supports this
extended syntax.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">#lang sicp
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tagged-list?</span> exp tag)
  (<span style="color: #531ab6;">if</span> (pair? exp)
      (eq? (car exp) tag)
      false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">begin?</span> exp) (tagged-list? exp 'begin))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">begin-actions</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">last-exp?</span> seq) (null? (cdr seq)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-exp</span> seq) (car seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rest-exps</span> seq) (cdr seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">sequence-&gt;exp</span> seq)
  (<span style="color: #531ab6;">cond</span> ((null? seq) seq)
        ((last-exp? seq) (first-exp seq))
        (<span style="color: #531ab6;">else</span> (make-begin seq))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">sequence-&gt;exp2</span> seq)
  (<span style="color: #531ab6;">cond</span> ((null? seq) seq)
        ((last-exp? seq) (first-exp seq))
        (<span style="color: #531ab6;">else</span> (make-begin seq))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-begin</span> seq) (cons 'begin seq))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond?</span> exp) (tagged-list? exp 'cond))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-clauses</span> exp) (cdr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-else-clause?</span> clause)
  (eq? (cond-predicate clause) 'else))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-predicate</span> clause) (car clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-actions</span> clause) (cdr clause))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">alternative-cond-actions</span> clause)
  (list (caddr clause) (car clause)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cond-&gt;if</span> exp)
  (expand-clauses (cond-clauses exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-if</span> predicate consequent alternative)
  (list 'if predicate consequent alternative))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">alternative-cond?</span> exp)
  (eq? (cadr exp) '=&gt;))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">expand-clauses</span> clauses)
  (<span style="color: #531ab6;">if</span> (null? clauses)
      'false                          <span style="color: #595959;">; </span><span style="color: #595959;">no `else' clause</span>
      (<span style="color: #531ab6;">let</span> ((first (car clauses))
            (rest (cdr clauses)))
        (<span style="color: #531ab6;">if</span> (cond-else-clause? first)
            (<span style="color: #531ab6;">if</span> (null? rest)
                (<span style="color: #531ab6;">if</span> (alternative-cond? first)
                    (alternative-cond-actions first)
                    (sequence-&gt;exp (cond-actions first)))
                (error <span style="color: #3548cf;">"ELSE clause isn't last -- COND-&gt;IF"</span>
                       clauses))
            (make-if (cond-predicate first)
                     (<span style="color: #531ab6;">if</span> (alternative-cond? first)
                         (alternative-cond-actions first)
                         (sequence-&gt;exp (cond-actions first)))
                     (expand-clauses rest))))))

(cond-&gt;if
 '(<span style="color: #531ab6;">cond</span> ((assoc 'b '((a 1) (b 2))) =&gt; cadr)
        (<span style="color: #531ab6;">else</span> false)))
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt;</span>
<span style="color: #595959;">;;</span><span style="color: #595959;">(if (assoc 'b '((a 1) (b 2)))</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">(cadr (assoc 'b '((a 1) (b 2))))</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">false)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org642cd9a" class="outline-4">
<h4 id="org642cd9a">Exercise 4.6</h4>
<div class="outline-text-4" id="text-org642cd9a">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
`Let' expressions are derived expressions, because
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">let</span> ((<span style="color: #005f5f;">&lt;VAR_1&gt;</span> <span style="color: #005f5f;">&lt;EXP_1&gt;</span>) ... (<span style="color: #005f5f;">&lt;VAR_N&gt;</span> <span style="color: #005f5f;">&lt;EXP_N&gt;</span>))
  <span style="color: #005f5f;">&lt;BODY&gt;</span>)
</pre>
</div>

<p>
is equivalent to
</p>

<div class="org-src-container">
<pre class="src src-scheme">((<span style="color: #531ab6;">lambda</span> (<span style="color: #005f5f;">&lt;VAR_1&gt;</span> ... <span style="color: #005f5f;">&lt;VAR_N&gt;</span>)
   <span style="color: #005f5f;">&lt;BODY&gt;</span>)
 <span style="color: #005f5f;">&lt;EXP_1&gt;</span>
 ...
 <span style="color: #005f5f;">&lt;EXP_N&gt;</span>)
</pre>
</div>

<p>
Implement a syntactic transformation <code>let-&gt;combination</code> that reduces
evaluating <code>let</code> expressions to evaluating combinations of the type
shown above, and add the appropriate clause to <code>eval</code> to handle <code>let</code>
expressions.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">#lang sicp
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tagged-list?</span> exp tag)
  (<span style="color: #531ab6;">if</span> (pair? exp)
      (eq? (car exp) tag)
      false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let?</span> exp) (tagged-list? exp 'let))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-vars</span> exp)
  (<span style="color: #531ab6;">map</span> car (cadr exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-exps</span> exp)
  (<span style="color: #531ab6;">map</span> cadr (cadr exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-body</span> exp)
  (cddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-combination</span> exp)
  (cons (list 'lambda
              (let-vars exp)
              (let-body exp))
        (let-exps exp)))

<span style="color: #595959;">;; </span><span style="color: #595959;">Example:</span>
(<span style="color: #531ab6;">let</span> ((let-exp '(<span style="color: #531ab6;">let</span> ((foo (* 2 4))
                      (bar (* 4 6)))
                  (display foo)
                  (display bar))))
  (let-combination let-exp))
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt;</span>
<span style="color: #595959;">;;</span><span style="color: #595959;">((lambda (foo bar)</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">((display foo)</span>
<span style="color: #595959;">;;    </span><span style="color: #595959;">(display bar)))</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(* 2 4) (* 4 6))</span>

<span style="color: #595959;">;; </span><span style="color: #595959;">Modifying eval:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval</span> exp env)
  (<span style="color: #531ab6;">cond</span> ((self-evaluating? exp) exp)
        ((variable? exp) (lookup-variable-value exp env))
        ((quoted? exp) (text-of-quotation exp))
        ((assignment? exp) (eval-assignment exp env))
        ((definition? exp) (eval-definition exp env))
        ((if? exp) (eval-if exp env))
        ((lambda? exp)
         (make-procedure (lambda-parameters exp)
                         (lambda-body exp)
                         env))
        ((begin? exp)
         (eval-sequence (begin-actions exp) env))
        ((cond? exp) (eval (cond-&gt;if exp) env))
        ((let? exp) (eval (let-combination) env)) <span style="color: #595959;">;; </span><span style="color: #595959;">&lt;----------------</span>
        ((application? exp)
         (apply (eval (operator exp) env)
                (list-of-values (operands exp) env)))
        (<span style="color: #531ab6;">else</span>
         (error <span style="color: #3548cf;">"Unknown expression type -- EVAL"</span> exp))))
</pre>
</div>
</div>
</div>
