blog/31.org
*** Exercise 4.7
*Exercise*:
#+begin_quote
~Let*~ is similar to ~let~, except that the bindings of the ~let~
variables are performed sequentially from left to right, and each
binding is made in an environment in which all of the preceding
bindings are visible.  For example

#+begin_src scheme
  (let* ((x 3)
         (y (+ x 2))
         (z (+ x y 5)))
    (* x z))
#+end_src

returns 39.  Explain how a ~let*~ expression can be rewritten as a set
of nested ~let~ expressions, and write a procedure ~let*->nested-lets~
that performs this transformation.  If we have already implemented
~let~ (exercise 4-6) and we want to extend the evaluator to handle
~let*~, is it sufficient to add a clause to ~eval~ whose action is

#+begin_src scheme
  (eval (let*->nested-lets exp) env)
#+end_src

or must we explicitly expand ~let*~ in terms of non-derived
expressions?
#+end_quote

*Answer*:

This is the way we can translate the example given:

#+begin_src scheme
  (let (x 3)
    (let (y (+ x 2))
      (let (z (+ x y 5))
        (* x z))))
#+end_src

Here is ~let*->nested-lets~:

#+begin_src scheme
  (define (let*-bindings exp)
    (cadr exp))

  (define (let*-first-binding exp)
    (car (let*-bindings exp)))

  (define (let*-rest-bindings exp)
    (cdr (let*-bindings exp)))

  (define (let*-body exp)
    (caddr exp))

  (define (let*->nested-lets exp)
    (cond ((null? (let*-bindings exp))
           (let*-body exp))
          (else (cons 'let
                      (list (list (let*-first-binding exp))
                            (let*->nested-lets
                             (cons 'let*
                                   (list (let*-rest-bindings exp)
                                         (let*-body exp)))))))))

  (let*->nested-lets '(let* ((x 3)
                             (y (+ x 2)))
                        (* x y)))
  ;; =>
  ;; (let ((x 3))
  ;;   (let ((y (+ x 2)))
  ;;     (* x y)))

  (let*->nested-lets '(let* ((x 3)
                             (y (+ x 2))
                             (z (+ x y 5)))
                        (* x z)))
  ;; =>
  ;; (let ((x 3))
  ;;   (let ((y (+ x 2)))
  ;;     (let ((z (+ x y 5)))
  ;;       (* x z))))
#+end_src

Adding ~(eval (let*->nested-lets exp) env)~ to ~eval~ should be
sufficient, in the same way we do for ~cond~. Or am I missing
something?

*** Exercise 4.8
#+begin_quote
"Named ~let~" is a variant of ~let~ that has the form

~(let <VAR> <BINDINGS> <BODY>)~

The <BINDINGS> and <BODY> are just as in ordinary ~let~, except that
<VAR> is bound within <BODY> to a procedure whose body is <BODY> and
whose parameters are the variables in the <BINDINGS>.  Thus, one can
repeatedly execute the <BODY> by invoking the procedure named <VAR>.
For example, the iterative Fibonacci procedure (1.2.2) can be
rewritten using named ~let~ as follows:

#+begin_src scheme
  (define (fib n)
    (let fib-iter ((a 1) (b 0) (count n))
      (if (= count 0)
          b
          (fib-iter (+ a b) a (- count 1)))))
#+end_src

Modify ~let->combination~ of Exercise 4-6 to also support named ~let~.
#+end_quote

*Answer*:

Basically, I'm making ~let->combination~ transform the ``named ~let~''
into the ~fib-iter~ definition and call as presented in 1.2.2.

#+begin_src scheme
  #lang sicp
  (define (tagged-list? exp tag)
    (if (pair? exp)
        (eq? (car exp) tag)
        false))

  (define (let? exp) (tagged-list? exp 'let))

  (define (let-vars exp)
    (map car (cadr exp)))

  (define (let-exps exp)
    (map cadr (cadr exp)))

  (define (let-body exp)
    (cddr exp))

  (define (named-let->combination exp)
    (let ((nameless (cons (car exp) (cddr exp)))
          (name (cadr exp)))

      (cons 'begin (list (cons 'define
                               (cons (cons name (let-vars nameless))
                                     (let-body nameless)))
                         (cons name (let-exps nameless))))))

  (define (let->combination exp)
    (if (not (pair? (cadr exp)))
        (named-let->combination exp)
        (cons (list 'lambda
                    (let-vars exp)
                    (let-body exp))
              (let-exps exp))))

  (let ((let-exp '(let fib-iter ((a 1) (b 0) (count n))
                    (if (= count 0)
                        b
                        (fib-iter (+ a b) a (- count 1))))))
    (let->combination let-exp))

  ;; =>
  ;; (begin
  ;;   (define (fib-iter a b count)
  ;;     (if (= count 0) b (fib-iter (+ a b) a (- count 1))))
  ;;   (fib-iter 1 0 n))
#+end_src

