blog/31.html

<div id="outline-container-orgf533380" class="outline-4">
<h4 id="orgf533380">Exercise 4.7</h4>
<div class="outline-text-4" id="text-orgf533380">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
<code>Let*</code> is similar to <code>let</code>, except that the bindings of the <code>let</code>
variables are performed sequentially from left to right, and each
binding is made in an environment in which all of the preceding
bindings are visible.  For example
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">let*</span> ((x 3)
       (y (+ x 2))
       (z (+ x y 5)))
  (* x z))
</pre>
</div>

<p>
returns 39.  Explain how a <code>let*</code> expression can be rewritten as a set
of nested <code>let</code> expressions, and write a procedure <code>let*-&gt;nested-lets</code>
that performs this transformation.  If we have already implemented
<code>let</code> (exercise 4-6) and we want to extend the evaluator to handle
<code>let*</code>, is it sufficient to add a clause to <code>eval</code> whose action is
</p>

<div class="org-src-container">
<pre class="src src-scheme">(eval (let*-&gt;nested-lets exp) env)
</pre>
</div>

<p>
or must we explicitly expand <code>let*</code> in terms of non-derived
expressions?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
This is the way we can translate the example given:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">let</span> (x 3)
  (<span style="color: #531ab6;">let</span> (y (+ x 2))
    (<span style="color: #531ab6;">let</span> (z (+ x y 5))
      (* x z))))
</pre>
</div>

<p>
Here is <code>let*-&gt;nested-lets</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let*-bindings</span> exp)
  (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let*-first-binding</span> exp)
  (car (let*-bindings exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let*-rest-bindings</span> exp)
  (cdr (let*-bindings exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let*-body</span> exp)
  (caddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let*-&gt;nested-lets</span> exp)
  (<span style="color: #531ab6;">cond</span> ((null? (let*-bindings exp))
         (let*-body exp))
        (<span style="color: #531ab6;">else</span> (cons 'let
                    (list (list (let*-first-binding exp))
                          (let*-&gt;nested-lets
                           (cons 'let*
                                 (list (let*-rest-bindings exp)
                                       (let*-body exp)))))))))

(let*-&gt;nested-lets '(<span style="color: #531ab6;">let*</span> ((x 3)
                           (y (+ x 2)))
                      (* x y)))
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(let ((x 3))</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">(let ((y (+ x 2)))</span>
<span style="color: #595959;">;;     </span><span style="color: #595959;">(* x y)))</span>

(let*-&gt;nested-lets '(<span style="color: #531ab6;">let*</span> ((x 3)
                           (y (+ x 2))
                           (z (+ x y 5)))
                      (* x z)))
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(let ((x 3))</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">(let ((y (+ x 2)))</span>
<span style="color: #595959;">;;     </span><span style="color: #595959;">(let ((z (+ x y 5)))</span>
<span style="color: #595959;">;;       </span><span style="color: #595959;">(* x z))))</span>
</pre>
</div>

<p>
Adding <code>(eval (let*-&gt;nested-lets exp) env)</code> to <code>eval</code> should be
sufficient, in the same way we do for <code>cond</code>. Or am I missing
something?
</p>
</div>
</div>

<div id="outline-container-org8f89bf2" class="outline-4">
<h4 id="org8f89bf2">Exercise 4.8</h4>
<div class="outline-text-4" id="text-org8f89bf2">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
"Named <code>let</code>" is a variant of <code>let</code> that has the form
</p>

<p>
<code>(let &lt;VAR&gt; &lt;BINDINGS&gt; &lt;BODY&gt;)</code>
</p>

<p>
The &lt;BINDINGS&gt; and &lt;BODY&gt; are just as in ordinary <code>let</code>, except that
&lt;VAR&gt; is bound within &lt;BODY&gt; to a procedure whose body is &lt;BODY&gt; and
whose parameters are the variables in the &lt;BINDINGS&gt;.  Thus, one can
repeatedly execute the &lt;BODY&gt; by invoking the procedure named &lt;VAR&gt;.
For example, the iterative Fibonacci procedure (1.2.2) can be
rewritten using named <code>let</code> as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">fib</span> n)
  (<span style="color: #531ab6;">let</span> <span style="color: #721045;">fib-iter</span> ((a 1) (b 0) (count n))
    (<span style="color: #531ab6;">if</span> (= count 0)
        b
        (fib-iter (+ a b) a (- count 1)))))
</pre>
</div>

<p>
Modify <code>let-&gt;combination</code> of Exercise 4-6 to also support named <code>let</code>.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Basically, I'm making <code>let-&gt;combination</code> transform the ``named <code>let</code>''
into the <code>fib-iter</code> definition and call as presented in 1.2.2.
</p>

<div class="org-src-container">
<pre class="src src-scheme">#lang sicp
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">tagged-list?</span> exp tag)
  (<span style="color: #531ab6;">if</span> (pair? exp)
      (eq? (car exp) tag)
      false))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let?</span> exp) (tagged-list? exp 'let))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-vars</span> exp)
  (<span style="color: #531ab6;">map</span> car (cadr exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-exps</span> exp)
  (<span style="color: #531ab6;">map</span> cadr (cadr exp)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-body</span> exp)
  (cddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">named-let-&gt;combination</span> exp)
  (<span style="color: #531ab6;">let</span> ((nameless (cons (car exp) (cddr exp)))
        (name (cadr exp)))

    (cons 'begin (list (cons 'define
                             (cons (cons name (let-vars nameless))
                                   (let-body nameless)))
                       (cons name (let-exps nameless))))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">let-&gt;combination</span> exp)
  (<span style="color: #531ab6;">if</span> (not (pair? (cadr exp)))
      (named-let-&gt;combination exp)
      (cons (list 'lambda
                  (let-vars exp)
                  (let-body exp))
            (let-exps exp))))

(<span style="color: #531ab6;">let</span> ((let-exp '(<span style="color: #531ab6;">let</span> <span style="color: #721045;">fib-iter</span> ((a 1) (b 0) (count n))
                  (<span style="color: #531ab6;">if</span> (= count 0)
                      b
                      (fib-iter (+ a b) a (- count 1))))))
  (let-&gt;combination let-exp))

<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(begin</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">(define (fib-iter a b count)</span>
<span style="color: #595959;">;;     </span><span style="color: #595959;">(if (= count 0) b (fib-iter (+ a b) a (- count 1))))</span>
<span style="color: #595959;">;;   </span><span style="color: #595959;">(fib-iter 1 0 n))</span>
</pre>
</div>
</div>
</div>
