blog/31.org
*** Exercise 4.9
*Exercise*:
#+begin_quote
Many languages support a variety of iteration constructs, such as
`do', `for', `while', and `until'.  In Scheme, iterative processes can
be expressed in terms of ordinary procedure calls, so special
iteration constructs provide no essential gain in computational power.
On the other hand, such constructs are often convenient.  Design some
iteration constructs, give examples of their use, and show how to
implement them as derived expressions.Many languages support a variety
of iteration constructs, such as `do', `for', `while', and `until'.
In Scheme, iterative processes can be expressed in terms of ordinary
procedure calls, so special iteration constructs provide no essential
gain in computational power.  On the other hand, such constructs are
often convenient.  Design some iteration constructs, give examples of
their use, and show how to implement them as derived expressions.
#+end_quote

*Answer*:

We could design a ~while~ construct with this syntax:

#+begin_src scheme
  (while (<operator> <operand1> <operand2>)
         <body>)
#+end_src

Here is an example:
#+begin_src scheme
  (while (> foo 0)
         (display foo)
         (set! foo (- foo 1)))
#+end_src

We have learnt that we can iterate using procedures. The ~while~ loop
above can be implement in the following way:
#+begin_src scheme
  (define (gp-while)
    (if (> foo 0)
        (begin
          (display foo)
          (set! foo (- foo 1))
          (gp-while))))

  (gp-while)
#+end_src

~While->combination~ transforms the new ~while~ syntax into procedural
syntax:
#+begin_src scheme
  (define (append l1 l2)
      (if (null? l1)
          l2
          (cons (car l1) (append (cdr l1) l2))))

    (define (while-cond exp)
      (cadr exp))

    (define (while-body exp)
      (cddr exp))

    (define (while->combination exp)
      (list 'begin
            (list 'define
                  (list 'gp-while)
                  (list 'if
                        (while-cond exp)
                        (cons
                         'begin
                         (append
                          (while-body exp)
                          (list (list 'gp-while))))))
            (list 'gp-while)))
  ;; =>
  ;; (begin (define (gp-while)
  ;;        (if (> foo 0)
  ;;            (begin (display foo)
  ;;                   (set! foo (- foo 1))
  ;;                   (gp-while))))
  ;;     (gp-while))
#+end_src

Now ~while~ can be handled as a derived expression by the evaluator:

#+begin_src scheme
  (define (eval exp env)
    (cond
     ;; ...
     ((while? exp) (eval (while->combination exp) env)
     ;; ...
  ))
#+end_src

[comment from the future: the begin in ~gp-while~ should not be
necessary. See p. 221 fn. 3]
*** Exercise 4.10
#+begin_quote
By using data abstraction, we were able to write an ~eval~ procedure
that is independent of the particular syntax of the language to be
evaluated.  To illustrate this, design and implement a new syntax for
Scheme by modifying the procedures in this section, without changing
~eval~ or ~apply~.
#+end_quote

*Answer*:
A couple of examples:
#+begin_src scheme
  ;; 'quotation instead of 'quote
  (define (quoted? exp)
    (tagged-list? exp 'quotation))

  (define (text-of-quotation exp) (cadr exp))

  ;; (assign! <value> <exp>) instead of (set! <exp> <val>)
  (define (assignment? exp)
    (tagged-list? exp 'assing!))

  (define (assignment-variable exp) (caddr exp))

  (define (assignment-value exp) (cadr exp))
#+end_src


#+begin_export html
<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
#+end_export
