blog/31.html

<div id="outline-container-org51ca187" class="outline-4">
<h4 id="org51ca187">Exercise 4.9</h4>
<div class="outline-text-4" id="text-org51ca187">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Many languages support a variety of iteration constructs, such as
`do', `for', `while', and `until'.  In Scheme, iterative processes can
be expressed in terms of ordinary procedure calls, so special
iteration constructs provide no essential gain in computational power.
On the other hand, such constructs are often convenient.  Design some
iteration constructs, give examples of their use, and show how to
implement them as derived expressions.Many languages support a variety
of iteration constructs, such as `do', `for', `while', and `until'.
In Scheme, iterative processes can be expressed in terms of ordinary
procedure calls, so special iteration constructs provide no essential
gain in computational power.  On the other hand, such constructs are
often convenient.  Design some iteration constructs, give examples of
their use, and show how to implement them as derived expressions.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
We could design a <code>while</code> construct with this syntax:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(while (<span style="color: #005f5f;">&lt;operator&gt;</span> <span style="color: #005f5f;">&lt;operand1&gt;</span> <span style="color: #005f5f;">&lt;operand2&gt;</span>)
       <span style="color: #005f5f;">&lt;body&gt;</span>)
</pre>
</div>

<p>
Here is an example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(while (&gt; foo 0)
       (display foo)
       (set! foo (- foo 1)))
</pre>
</div>

<p>
We have learnt that we can iterate using procedures. The <code>while</code> loop
above can be implement in the following way:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">gp-while</span>)
  (<span style="color: #531ab6;">if</span> (&gt; foo 0)
      (<span style="color: #531ab6;">begin</span>
        (display foo)
        (set! foo (- foo 1))
        (gp-while))))

(gp-while)
</pre>
</div>

<p>
<code>While-&gt;combination</code> transforms the new <code>while</code> syntax into procedural
syntax:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">append</span> l1 l2)
    (<span style="color: #531ab6;">if</span> (null? l1)
        l2
        (cons (car l1) (append (cdr l1) l2))))

  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">while-cond</span> exp)
    (cadr exp))

  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">while-body</span> exp)
    (cddr exp))

  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">while-&gt;combination</span> exp)
    (list 'begin
          (list 'define
                (list 'gp-while)
                (list 'if
                      (while-cond exp)
                      (cons
                       'begin
                       (append
                        (while-body exp)
                        (list (list 'gp-while))))))
          (list 'gp-while)))
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt;</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(begin (define (gp-while)</span>
<span style="color: #595959;">;;        </span><span style="color: #595959;">(if (&gt; foo 0)</span>
<span style="color: #595959;">;;            </span><span style="color: #595959;">(begin (display foo)</span>
<span style="color: #595959;">;;                   </span><span style="color: #595959;">(set! foo (- foo 1))</span>
<span style="color: #595959;">;;                   </span><span style="color: #595959;">(gp-while))))</span>
<span style="color: #595959;">;;     </span><span style="color: #595959;">(gp-while))</span>
</pre>
</div>

<p>
Now <code>while</code> can be handled as a derived expression by the evaluator:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval</span> exp env)
  (<span style="color: #531ab6;">cond</span>
   <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
   ((while? exp) (eval (while-&gt;combination exp) env)
   <span style="color: #595959;">;; </span><span style="color: #595959;">...</span>
))
</pre>
</div>

<p>
[comment from the future: the begin in <code>gp-while</code> should not be
necessary. See p. 221 fn. 3]
</p>
</div>
</div>
<div id="outline-container-org9e46424" class="outline-4">
<h4 id="org9e46424">Exercise 4.10</h4>
<div class="outline-text-4" id="text-org9e46424">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
By using data abstraction, we were able to write an <code>eval</code> procedure
that is independent of the particular syntax of the language to be
evaluated.  To illustrate this, design and implement a new syntax for
Scheme by modifying the procedures in this section, without changing
<code>eval</code> or <code>apply</code>.
</p>
</blockquote>

<p>
<b>Answer</b>:
A couple of examples:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">'quotation instead of 'quote</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">quoted?</span> exp)
  (tagged-list? exp 'quotation))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">text-of-quotation</span> exp) (cadr exp))

<span style="color: #595959;">;; </span><span style="color: #595959;">(assign! &lt;value&gt; &lt;exp&gt;) instead of (set! &lt;exp&gt; &lt;val&gt;)</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment?</span> exp)
  (tagged-list? exp 'assing!))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment-variable</span> exp) (caddr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">assignment-value</span> exp) (cadr exp))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html"></a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</span></p>
</div>
</body>
</html>
